In [1]:
import pandas as pd
import numpy as np

train_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
%matplotlib inline
from matplotlib import pyplot as plt
survived = pd.Series(train_df['Survived'].groupby(train_df['SibSp']).sum())
survived

SibSp
0    210
1    112
2     13
3      4
4      3
5      0
8      0
Name: Survived, dtype: int64

In [3]:
train_df['Sex'] = train_df['Sex'].apply(lambda x: int(x!="male"))
test_df['Sex'] = test_df['Sex'].apply(lambda x: int(x!="male"))
train_df['Embarked'] = train_df['Embarked'].apply(lambda x: int(x!="C"))
test_df['Embarked'] = test_df['Embarked'].apply(lambda x: int(x!="S"))

In [4]:
feature_names = ['Pclass','Sex','SibSp','Parch','Embarked']
X_train = train_df[feature_names]
y_train = train_df['Survived']
X_train

     Pclass  Sex  SibSp  Parch  Embarked
0         3    0      1      0         1
1         1    1      1      0         0
2         3    1      0      0         1
3         1    1      1      0         1
4         3    0      0      0         1
..      ...  ...    ...    ...       ...
886       2    0      0      0         1
887       1    1      0      0         1
888       3    1      1      2         1
889       1    0      0      0         0
890       3    0      0      0         1

[891 rows x 5 columns]

In [5]:
X_test = test_df[feature_names]

In [6]:
from sklearn.model_selection import train_test_split
X_train1, X_test1, y_train1, y_test1 = train_test_split(X_train,y_train,test_size=0.33, random_state=42)

In [104]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.svm import LinearSVC
from sklearn.naive_bayes import GaussianNB
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.neural_network import MLPClassifier

In [135]:
clf = MLPClassifier(learning_rate = 0.1, max_depth = 3,random_state = 0).fit(X_train1, y_train1)
# clf = DecisionTreeClassifier(max_depth = 4, min_samples_leaf = 5,
#                             random_state = 0).fit(X_train1, y_train1)
y_predict = clf.predict(X_test1)

In [136]:
from sklearn.metrics import accuracy_score
y_predict1 = clf.predict(X_train1)
accuracy_score(y_predict1,y_train1)

0.8154362416107382

In [137]:
accuracy_score(y_predict,y_test1)

0.7830508474576271